taurus_test.yml
modules:
  jmeter:
    memory-xmx: 6G
    path: ./jmeter/bin/jmeter
    download-link: https://archive.apache.org/dist/jmeter/binaries/apache-jmeter-{version}.zip
    version: 4.0
    force-ctg: true   # true by default
    detect-plugins: true

execution:
  - iterations: 1
    concurrency: 500
    scenario: test_case_1
  - iterations: 1
    concurrency: 500
    scenario: test_case_2
  - iterations: 1
    concurrency: 500
    scenario: test_case_3
  - iterations: 1
    concurrency: 500
    scenario: test_case_4

scenarios:
  test_case_1:
    script: jmeter_test_cases/MS_Server/TestCase#1_SQLServer.jmx
  test_case_2:
    script: jmeter_test_cases/MS_Server/TestCase#2_SQLServer.jmx
  test_case_3:
    script: jmeter_test_cases/MS_Server/TestCase#3_SQLServer.jmx
  test_case_4:
    script: jmeter_test_cases/MS_Server/TestCase#4_SQLServer.jmx

reporting:
  - module: final-stats
    summary: true
    percentiles: true
    failed-labels: false
    test-duration: true
    dump-csv: TaurusResult/perf_result_csv.csv
  - module: junit-xml
    data-source: pass-fail
    filename: TaurusResult/junit-result.xml